const bodyOptions = [
  'седан',
  'седан 2 дв.',
  'хэтчбек 5 дв.',
  'хэтчбек 4 дв.',
  'хэтчбек 3 дв.',
  'универсал 5 дв.',
  'универсал 3 дв.',
  'внедорожник 5 дв.',
  'внедорожник 3 дв.',
  'внедорожник открытый',
  'кабриолет',
  'компактвэн',
  'купе',
  'купе-хардтоп',
  'лимузин',
  'лифтбек',
  'микровэн',
  'минивэн',
  'пикап двойная кабина',
  'пикап одинарная кабина',
  'пикап полуторная кабина',
  'родстер',
  'седан-хардтоп',
  'спидстер',
  'тарга',
  'фастбек',
  'фаэтон',
  'фургон',
];

const colorOptions = [
  'бежевый',
  'белый',
  'голубой',
  'жёлтый',
  'зелёный',
  'золотистый',
  'коричневый',
  'красный',
  'оранжевый',
  'пурпурный',
  'розовый',
  'серебристый',
  'серый',
  'синий',
  'фиолетовый',
  'чёрный',
];

const fuelOptions = [
  'Бензин',
  'Дизель',
  'Газ',
  'Гибрид',
  'Бензин, газобаллонное оборудование',
  'Газ, газобаллонное оборудование',
  'Гибрид, газобаллонное оборудование',
  'Дизель, газобаллонное оборудование',
  'Электро',
];

const transmissionOptions = [
  'автоматическая',
  'механическая',
  'вариатор',
  'роботизированная',
];

const driveOptions = ['передний', 'задний', 'полный'];
const wheelOptions = ['Левый', 'Правый'];
const ptsOptions = ['Оригинал', 'Дубликат'];
const customsOptions = ['Растаможен', 'Не растаможен'];

export {
  bodyOptions,
  colorOptions,
  fuelOptions,
  transmissionOptions,
  driveOptions,
  wheelOptions,
  ptsOptions,
  customsOptions,
};
